<!-- tfplan-comment -->
## Terraform plan (Cloudflare DNS)

Commit: 3cb4bf0203cfb208012dde206e332f15dae0d754

<details><summary>Show plan</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # cloudflare_ruleset.redirects will be updated in-place
  ~ resource "cloudflare_ruleset" "redirects" {
      ~ description  = "Subdomain redirects" -> "Subdomain and path redirects"
        id           = "3ae06cd2cf254b50b6e9ef328c5fa356"
      ~ last_updated = "2026-01-17T18:20:31Z" -> (known after apply)
        name         = "Redirect rules"
      ~ rules        = [
          ~ {
              ~ action_parameters = {
                  ~ from_value = {
                      ~ target_url            = {
                          ~ expression = "concat(\"https://searle.dev/govision\", http.request.uri.path)" -> "concat(\"https://govision.app\", http.request.uri.path)"
                        }
                        # (2 unchanged attributes hidden)
                    }
                }
              ~ description       = "Redirect govision.searle.dev to searle.dev/govision/" -> "Redirect govision.searle.dev to govision.app"
              ~ id                = "95c0936bd848483d9619f1cdb2cbd68e" -> (known after apply)
              + logging           = (known after apply)
              ~ ref               = "95c0936bd848483d9619f1cdb2cbd68e" -> (known after apply)
                # (3 unchanged attributes hidden)
            },
          + {
              + action            = "redirect"
              + action_parameters = {
                  + from_value = {
                      + preserve_query_string = true
                      + status_code           = 301
                      + target_url            = {
                          + expression = "concat(\"https://govision.app\", substring(http.request.uri.path, 9))"
                        }
                    }
                }
              + description       = "Redirect searle.dev/govision/* to govision.app/*"
              + enabled           = true
              + expression        = "(http.host eq \"searle.dev\" and starts_with(http.request.uri.path, \"/govision\"))"
              + id                = (known after apply)
              + logging           = (known after apply)
              + ref               = (known after apply)
            },
        ]
      ~ version      = "1" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # cloudflare_workers_script.govision_app_proxy will be updated in-place
  ~ resource "cloudflare_workers_script" "govision_app_proxy" {
      ~ bindings            = [] -> (known after apply)
      ~ content_sha256      = "cb14a507b19323a77d17bcdc80db7c974aedaa4e997ed3befd2f03a63a8b005b" -> "c7dee71c70e2919f5001d12ca3a22bc08ea6599074d1a6973659c3d78cfd61fa"
      ~ etag                = "70446ca130338f62ff0afaf9262d98e298e606e060cda36dc68e6d9720d091d7" -> (known after apply)
      ~ handlers            = [
          - "fetch",
        ] -> (known after apply)
      ~ has_assets          = false -> (known after apply)
      ~ has_modules         = true -> (known after apply)
        id                  = "govision-app-proxy"
      ~ last_deployed_from  = "terraform" -> (known after apply)
      + migration_tag       = (known after apply)
      ~ modified_on         = "2026-01-21T12:40:43Z" -> (known after apply)
      + named_handlers      = (known after apply)
      + placement           = (known after apply)
      ~ startup_time_ms     = 0 -> (known after apply)
      ~ tail_consumers      = [] -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.


```
</details>